OF4.0/tutorials/Cellino/0.org/197.8/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "197.8";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
400
(
0.290876
0.130782
0.0840324
0.0616234
0.048583
0.0400797
0.0341032
0.029674
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    bottom
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        type            epsilonWallFunction;
        value           uniform 0.290876;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
