OF4.0/tutorials/Cellino/system/autoReconstruct
#!/bin/bash
cd ..
while true
do
	reconstructPar -newTimes
	echo "Run in: "
	secs=$((1 * 60))
	while [ $secs -gt 0 ]; do
	   echo -ne "$secs\033[0K\r"
	   sleep 1
	   : $((secs--))
	done
done
