OF4.0/tutorials/Cellino/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
        default         Gauss linear;
}


divSchemes
{
    default         Gauss linear;

    div(rhoPhi,U)  			Gauss limitedLinearV 1; //Gauss linearUpwind grad(U);

    div(phi,alphad)  		Gauss limitedLinear01 1; //Gauss vanLeer;
    div(phir,alphad)		Gauss limitedLinear01 1; //Gauss linear;

    div(phi,alphac)  		Gauss vanLeer;
    div(phirb,alphac) 		Gauss linear;

    div(rhoPhi,k)     Gauss limitedLinear 1;
    div(rhoPhi,epsilon) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default  linear;
}

snGradSchemes
{
    default         corrected;
}
// ************************************************************************* //
