OF4.0/tutorials/Cellino/system/setDiscreteFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setDiscreteFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Fields
(
	Uprofile
		{
			field U;        	//targetField        		
		    type vector;    	//type "scalar" or "vector" 
			direction "y";  	//direction "x","y", or "z" 
			internal false ;  	//set internal field or not ,false or false

			patchNames
		    (
		    	inlet 			//patchNames to set value. Must be initially set to fixedValue 
		    );
		         
		    profile				//if type is vector (x y z Ux Uy Uz)
		    (
		    	(0 0 0 0 0 0)
				(0 0.0012 0 0.3496 0 0)
				(0 0.0024 0 0.41107 0 0)
				(0 0.0036 0 0.44654 0 0)
				(0 0.0048 0 0.47169 0 0)
				(0 0.006 0 0.49128 0 0)
				(0 0.0072 0 0.50737 0 0)
				(0 0.0084 0 0.52105 0 0)
				(0 0.0096 0 0.53299 0 0)
				(0 0.0108 0 0.54358 0 0)
				(0 0.012 0 0.55312 0 0)
				(0 0.0132 0 0.56181 0 0)
				(0 0.0144 0 0.56979 0 0)
				(0 0.0156 0 0.57718 0 0)
				(0 0.0168 0 0.58406 0 0)
				(0 0.018 0 0.59051 0 0)
				(0 0.0192 0 0.59658 0 0)
				(0 0.0204 0 0.60232 0 0)
				(0 0.0216 0 0.60776 0 0)
				(0 0.0228 0 0.61294 0 0)
				(0 0.024 0 0.61788 0 0)
				(0 0.0252 0 0.6226 0 0)
				(0 0.0264 0 0.62714 0 0)
				(0 0.0276 0 0.63149 0 0)
				(0 0.0288 0 0.63568 0 0)
				(0 0.03 0 0.63971 0 0)
				(0 0.0312 0 0.64361 0 0)
				(0 0.0324 0 0.64738 0 0)
				(0 0.0336 0 0.65103 0 0)
				(0 0.0348 0 0.65456 0 0)
				(0 0.036 0 0.65799 0 0)
				(0 0.0372 0 0.66131 0 0)
				(0 0.0384 0 0.66454 0 0)
				(0 0.0396 0 0.66768 0 0)
				(0 0.0408 0 0.67074 0 0)
				(0 0.042 0 0.67371 0 0)
				(0 0.0432 0 0.67661 0 0)
				(0 0.0444 0 0.67943 0 0)
				(0 0.0456 0 0.68218 0 0)
				(0 0.0468 0 0.68486 0 0)
				(0 0.048 0 0.68748 0 0)
				(0 0.0492 0 0.69004 0 0)
				(0 0.0504 0 0.69253 0 0)
				(0 0.0516 0 0.69497 0 0)
				(0 0.0528 0 0.69735 0 0)
				(0 0.054 0 0.69967 0 0)
				(0 0.0552 0 0.70194 0 0)
				(0 0.0564 0 0.70416 0 0)
				(0 0.0576 0 0.70633 0 0)
				(0 0.0588 0 0.70846 0 0)
				(0 0.06 0 0.71053 0 0)
				(0 0.0612 0 0.71256 0 0)
				(0 0.0624 0 0.71454 0 0)
				(0 0.0636 0 0.71648 0 0)
				(0 0.0648 0 0.71838 0 0)
				(0 0.066 0 0.72023 0 0)
				(0 0.0672 0 0.72205 0 0)
				(0 0.0684 0 0.72382 0 0)
				(0 0.0696 0 0.72556 0 0)
				(0 0.0708 0 0.72725 0 0)
				(0 0.072 0 0.72891 0 0)
				(0 0.0732 0 0.73054 0 0)
				(0 0.0744 0 0.73212 0 0)
				(0 0.0756 0 0.73367 0 0)
				(0 0.0768 0 0.73519 0 0)
				(0 0.078 0 0.73667 0 0)
				(0 0.0792 0 0.73812 0 0)
				(0 0.0804 0 0.73953 0 0)
				(0 0.0816 0 0.74091 0 0)
				(0 0.0828 0 0.74226 0 0)
				(0 0.084 0 0.74358 0 0)
				(0 0.0852 0 0.74486 0 0)
				(0 0.0864 0 0.74612 0 0)
				(0 0.0876 0 0.74734 0 0)
				(0 0.0888 0 0.74854 0 0)
				(0 0.09 0 0.7497 0 0)
				(0 0.0912 0 0.75084 0 0)
				(0 0.0924 0 0.75194 0 0)
				(0 0.0936 0 0.75302 0 0)
				(0 0.0948 0 0.75407 0 0)
				(0 0.096 0 0.75509 0 0)
				(0 0.0972 0 0.75609 0 0)
				(0 0.0984 0 0.75705 0 0)
				(0 0.0996 0 0.758 0 0)
				(0 0.1008 0 0.75891 0 0)
				(0 0.102 0 0.7598 0 0)
				(0 0.1032 0 0.76067 0 0)
				(0 0.1044 0 0.76151 0 0)
				(0 0.1056 0 0.76233 0 0)
				(0 0.1068 0 0.76312 0 0)
				(0 0.108 0 0.7639 0 0)
				(0 0.1092 0 0.76465 0 0)
				(0 0.1104 0 0.76538 0 0)
				(0 0.1116 0 0.7661 0 0)
				(0 0.1128 0 0.7668 0 0)
				(0 0.114 0 0.76749 0 0)
				(0 0.1152 0 0.76817 0 0)
				(0 0.1164 0 0.76885 0 0)
				(0 0.1176 0 0.76955 0 0)
				(0 0.1188 0 0.77032 0 0)
				(0 0.12 0 0.77145 0 0)
		    );              
		}

	kProfile
		{
			field k;        	//targetField        		
		    type scalar;    	//type "scalar" or "vector" 
			direction "y";  	//direction "x","y", or "z" 
			internal false ;  	//set internal field or not ,false or false

			patchNames
		    (
		    	inlet 			//patchNames to set value. Must be initially set to fixedValue  
		    );
		         
		    profile				//if type is vector (x y z Ux Uy Uz)
		    (
		    	(0 0 0 0)
				(0 0.0012 0 0.0038155)
				(0 0.0024 0 0.0038555)
				(0 0.0036 0 0.0038434)
				(0 0.0048 0 0.0038172)
				(0 0.006 0 0.0037855)
				(0 0.0072 0 0.0037512)
				(0 0.0084 0 0.0037157)
				(0 0.0096 0 0.0036797)
				(0 0.0108 0 0.0036435)
				(0 0.012 0 0.0036071)
				(0 0.0132 0 0.0035709)
				(0 0.0144 0 0.0035347)
				(0 0.0156 0 0.0034986)
				(0 0.0168 0 0.0034626)
				(0 0.018 0 0.0034267)
				(0 0.0192 0 0.0033909)
				(0 0.0204 0 0.0033551)
				(0 0.0216 0 0.0033195)
				(0 0.0228 0 0.0032838)
				(0 0.024 0 0.0032482)
				(0 0.0252 0 0.0032126)
				(0 0.0264 0 0.0031769)
				(0 0.0276 0 0.0031413)
				(0 0.0288 0 0.0031056)
				(0 0.03 0 0.0030699)
				(0 0.0312 0 0.0030341)
				(0 0.0324 0 0.0029983)
				(0 0.0336 0 0.0029625)
				(0 0.0348 0 0.0029265)
				(0 0.036 0 0.0028906)
				(0 0.0372 0 0.0028545)
				(0 0.0384 0 0.0028185)
				(0 0.0396 0 0.0027823)
				(0 0.0408 0 0.0027462)
				(0 0.042 0 0.0027099)
				(0 0.0432 0 0.0026737)
				(0 0.0444 0 0.0026374)
				(0 0.0456 0 0.0026011)
				(0 0.0468 0 0.0025648)
				(0 0.048 0 0.0025285)
				(0 0.0492 0 0.0024921)
				(0 0.0504 0 0.0024558)
				(0 0.0516 0 0.0024195)
				(0 0.0528 0 0.0023832)
				(0 0.054 0 0.002347)
				(0 0.0552 0 0.0023108)
				(0 0.0564 0 0.0022747)
				(0 0.0576 0 0.0022386)
				(0 0.0588 0 0.0022026)
				(0 0.06 0 0.0021666)
				(0 0.0612 0 0.0021308)
				(0 0.0624 0 0.002095)
				(0 0.0636 0 0.0020594)
				(0 0.0648 0 0.0020238)
				(0 0.066 0 0.0019884)
				(0 0.0672 0 0.0019531)
				(0 0.0684 0 0.0019179)
				(0 0.0696 0 0.0018829)
				(0 0.0708 0 0.001848)
				(0 0.072 0 0.0018133)
				(0 0.0732 0 0.0017788)
				(0 0.0744 0 0.0017443)
				(0 0.0756 0 0.0017101)
				(0 0.0768 0 0.001676)
				(0 0.078 0 0.0016422)
				(0 0.0792 0 0.0016084)
				(0 0.0804 0 0.0015749)
				(0 0.0816 0 0.0015415)
				(0 0.0828 0 0.0015083)
				(0 0.084 0 0.0014753)
				(0 0.0852 0 0.0014425)
				(0 0.0864 0 0.0014098)
				(0 0.0876 0 0.0013773)
				(0 0.0888 0 0.001345)
				(0 0.09 0 0.0013128)
				(0 0.0912 0 0.0012808)
				(0 0.0924 0 0.0012489)
				(0 0.0936 0 0.0012171)
				(0 0.0948 0 0.0011854)
				(0 0.096 0 0.0011537)
				(0 0.0972 0 0.0011221)
				(0 0.0984 0 0.0010905)
				(0 0.0996 0 0.0010588)
				(0 0.1008 0 0.0010271)
				(0 0.102 0 0.00099524)
				(0 0.1032 0 0.00096315)
				(0 0.1044 0 0.00093075)
				(0 0.1056 0 0.00089793)
				(0 0.1068 0 0.00086456)
				(0 0.108 0 0.00083045)
				(0 0.1092 0 0.00079537)
				(0 0.1104 0 0.00075902)
				(0 0.1116 0 0.00072095)
				(0 0.1128 0 0.00068055)
				(0 0.114 0 0.00063683)
				(0 0.1152 0 0.00058821)
				(0 0.1164 0 0.00053164)
				(0 0.1176 0 0.00046017)
				(0 0.1188 0 0.00034922)
				(0 0.12 0 0.000014451)
		    );              
		}


	eProfile
		{
			field epsilon;      //targetField        		
		    type scalar;    	//type "scalar" or "vector" 
			direction "y";  	//direction "x","y", or "z" 
			internal false ;  	//set internal field or not ,false or false

			patchNames
		    (
		    	inlet 			//patchNames to set value. Must be initially set to fixedValue  
		    );
		         	
		    profile				//if type is vector (x y z Ux Uy Uz)
		    (
		    	(0 0 0 0.57625)
				(0 0.0012 0 0.086981)
				(0 0.0024 0 0.042047)
				(0 0.0036 0 0.027715)
				(0 0.0048 0 0.020651)
				(0 0.006 0 0.016437)
				(0 0.0072 0 0.013636)
				(0 0.0084 0 0.011638)
				(0 0.0096 0 0.010139)
				(0 0.0108 0 0.0089739)
				(0 0.012 0 0.008041)
				(0 0.0132 0 0.0072772)
				(0 0.0144 0 0.0066401)
				(0 0.0156 0 0.0061003)
				(0 0.0168 0 0.0056371)
				(0 0.018 0 0.0052349)
				(0 0.0192 0 0.0048823)
				(0 0.0204 0 0.0045706)
				(0 0.0216 0 0.0042928)
				(0 0.0228 0 0.0040435)
				(0 0.024 0 0.0038185)
				(0 0.0252 0 0.0036142)
				(0 0.0264 0 0.0034278)
				(0 0.0276 0 0.0032569)
				(0 0.0288 0 0.0030996)
				(0 0.03 0 0.0029541)
				(0 0.0312 0 0.0028192)
				(0 0.0324 0 0.0026937)
				(0 0.0336 0 0.0025764)
				(0 0.0348 0 0.0024667)
				(0 0.036 0 0.0023636)
				(0 0.0372 0 0.0022667)
				(0 0.0384 0 0.0021752)
				(0 0.0396 0 0.0020888)
				(0 0.0408 0 0.0020069)
				(0 0.042 0 0.0019292)
				(0 0.0432 0 0.0018554)
				(0 0.0444 0 0.0017851)
				(0 0.0456 0 0.0017182)
				(0 0.0468 0 0.0016543)
				(0 0.048 0 0.0015932)
				(0 0.0492 0 0.0015348)
				(0 0.0504 0 0.0014789)
				(0 0.0516 0 0.0014252)
				(0 0.0528 0 0.0013738)
				(0 0.054 0 0.0013245)
				(0 0.0552 0 0.001277)
				(0 0.0564 0 0.0012314)
				(0 0.0576 0 0.0011876)
				(0 0.0588 0 0.0011454)
				(0 0.06 0 0.0011048)
				(0 0.0612 0 0.0010657)
				(0 0.0624 0 0.001028)
				(0 0.0636 0 0.00099168)
				(0 0.0648 0 0.00095667)
				(0 0.066 0 0.00092292)
				(0 0.0672 0 0.00089038)
				(0 0.0684 0 0.000859)
				(0 0.0696 0 0.00082873)
				(0 0.0708 0 0.00079954)
				(0 0.072 0 0.0007714)
				(0 0.0732 0 0.00074426)
				(0 0.0744 0 0.00071809)
				(0 0.0756 0 0.00069286)
				(0 0.0768 0 0.00066855)
				(0 0.078 0 0.00064512)
				(0 0.0792 0 0.00062256)
				(0 0.0804 0 0.00060084)
				(0 0.0816 0 0.00057995)
				(0 0.0828 0 0.00055985)
				(0 0.084 0 0.00054054)
				(0 0.0852 0 0.00052199)
				(0 0.0864 0 0.00050421)
				(0 0.0876 0 0.00048716)
				(0 0.0888 0 0.00047084)
				(0 0.09 0 0.00045525)
				(0 0.0912 0 0.00044038)
				(0 0.0924 0 0.00042621)
				(0 0.0936 0 0.00041276)
				(0 0.0948 0 0.00040002)
				(0 0.096 0 0.000388)
				(0 0.0972 0 0.00037671)
				(0 0.0984 0 0.00036616)
				(0 0.0996 0 0.00035638)
				(0 0.1008 0 0.00034738)
				(0 0.102 0 0.00033923)
				(0 0.1032 0 0.00033197)
				(0 0.1044 0 0.00032567)
				(0 0.1056 0 0.00032045)
				(0 0.1068 0 0.00031644)
				(0 0.108 0 0.00031385)
				(0 0.1092 0 0.00031296)
				(0 0.1104 0 0.0003142)
				(0 0.1116 0 0.00031822)
				(0 0.1128 0 0.00032609)
				(0 0.114 0 0.00033965)
				(0 0.1152 0 0.00036245)
				(0 0.1164 0 0.00040239)
				(0 0.1176 0 0.00048206)
				(0 0.1188 0 0.00071421)
				(0 0.12 0 0.1)
		    );              
		}

	alphaProfile
		{
			field alpha.sand;   //targetField        		
		    type scalar;    	//type "scalar" or "vector" 
			direction "y";  	//direction "x","y", or "z" 
			internal false ;  	//set internal field or not ,false or false

			patchNames
		    (
		    	inlet 			//patchNames to set value. Must be initially set to fixedValue  
		    );
		         
		    profile				//if type is vector (x y z Ux Uy Uz)
		    (
				(0 0 0 0.00929029)
		    	(0 0.006 0 0.00929029)
				(0 0.0072 0 0.006134599)
				(0 0.0084 0 0.004302881)
				(0 0.0096 0 0.003154208)
				(0 0.0108 0 0.002391255)
				(0 0.012 0 0.001861468)
				(0 0.0132 0 0.001480338)
				(0 0.0144 0 0.001198125)
				(0 0.0156 0 0.000984089)
				(0 0.0168 0 0.000818442)
				(0 0.018 0 0.00068801)
				(0 0.0192 0 0.00058376)
				(0 0.0204 0 0.000499342)
				(0 0.0216 0 0.000430195)
				(0 0.0228 0 0.000372977)
				(0 0.024 0 0.000325198)
				(0 0.0252 0 0.000284975)
				(0 0.0264 0 0.000250863)
				(0 0.0276 0 0.000221741)
				(0 0.0288 0 0.000196728)
				(0 0.03 0 0.000175125)
				(0 0.0312 0 0.000156372)
				(0 0.0324 0 0.000140017)
				(0 0.0336 0 0.000125694)
				(0 0.0348 0 0.000113099)
				(0 0.036 0 0.000101983)
				(0 0.0372 0 0.0000921392)
				(0 0.0384 0 0.0000833948)
				(0 0.0396 0 0.0000756039)
				(0 0.0408 0 0.0000686435)
				(0 0.042 0 0.0000624093)
				(0 0.0432 0 0.000056812)
				(0 0.0444 0 0.0000517756)
				(0 0.0456 0 0.0000472342)
				(0 0.0468 0 0.0000431313)
				(0 0.048 0 0.0000394178)
				(0 0.0492 0 0.0000360509)
				(0 0.0504 0 0.0000329934)
				(0 0.0516 0 0.0000302128)
				(0 0.0528 0 0.0000276804)
				(0 0.054 0 0.0000253711)
				(0 0.0552 0 0.0000232626)
				(0 0.0564 0 0.0000213352)
				(0 0.0576 0 0.0000195717)
				(0 0.0588 0 0.0000179563)
				(0 0.06 0 0.0000164755)
				(0 0.0612 0 0.0000151168)
				(0 0.0624 0 0.0000138691)
				(0 0.0636 0 0.0000127227)
				(0 0.0648 0 0.0000116686)
				(0 0.066 0 0.0000106989)
				(0 0.0672 0 0.00000980627)
				(0 0.0684 0 0.00000898432)
				(0 0.0696 0 0.00000822714)
				(0 0.0708 0 0.0000075294)
				(0 0.072 0 0.00000688628)
				(0 0.0732 0 0.00000629338)
				(0 0.0744 0 0.00000574672)
				(0 0.0756 0 0.00000524266)
				(0 0.0768 0 0.00000477789)
				(0 0.078 0 0.00000434938)
				(0 0.0792 0 0.00000395437)
				(0 0.0804 0 0.00000359031)
				(0 0.0816 0 0.0000032549)
				(0 0.0828 0 0.00000294599)
				(0 0.084 0 0.00000266164)
				(0 0.0852 0 0.00000240005)
				(0 0.0864 0 0.00000215955)
				(0 0.0876 0 0.00000193863)
				(0 0.0888 0 0.00000173587)
				(0 0.09 0 0.00000154999)
				(0 0.0912 0 0.00000137978)
				(0 0.0924 0 0.00000122414)
				(0 0.0936 0 0.00000108203)
				(0 0.0948 0 0.00000095251)
				(0 0.096 0 0.000000834696)
				(0 0.0972 0 0.00000072777)
				(0 0.0984 0 0.000000630973)
				(0 0.0996 0 0.000000543598)
				(0 0.1008 0 0.000000464988)
				(0 0.102 0 0.000000394531)
				(0 0.1032 0 0.000000331656)
				(0 0.1044 0 0.00000027583)
				(0 0.1056 0 0.000000226555)
				(0 0.1068 0 0.000000183365)
				(0 0.108 0 0.000000145821)
				(0 0.1092 0 0.000000113514)
				(0 0.1104 0 0.000000086057)
				(0 0.1116 0 0.0000000630837)
				(0 0.1128 0 0.0000000442477)
				(0 0.114 0 0.0000000292178)
				(0 0.1152 0 0.0000000176752)
				(0 0.1164 0 0.00000000930853)
				(0 0.1176 0 0.00000000380578)
				(0 0.1188 0 0.000000000838114)
				(0 0.12 0 0.00000000041957)
		    );              
		}
	
);

// *********************************************************************** //
